аОбласть ПРОГРАММНЫЙ_ИНТЕРФЕЙС
	
#КонецОбласти

#Область СОБЫТИЯ_ФОРМЫ
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПередПосле = "Перед";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры,, "ТолькоПросмотр,КлючНазначенияИспользования,ЗакрыватьПриЗакрытииВладельца,ЗакрыватьПриВыборе");
	ТолькоДляМеня = Истина;
	Если ?(Параметры.Свойство("РежимНастроек"), Параметры.РежимНастроек, Ложь) Тогда
		Если КудаСохранять = "#Файл" Тогда
			Элементы.ИмяКоманды.Видимость = Ложь;
		Иначе
			Элементы.ДекорацияПредупреждениеОФайле.Видимость = Ложь;
			Элементы.ИмяКоманды.Заголовок = "Имя настройки";
		КонецЕсли;
		Элементы.Представление.Видимость = Ложь;
		Элементы.ПередПосле.Видимость = Ложь;
		Элементы.Декорация1.Видимость = Ложь;
		Элементы.ПутьККоманде.Видимость = Ложь;
		Элементы.ПутьККартинке.Видимость = Ложь;
		Элементы.ХотКей.Видимость = Ложь;
		Элементы.Подсказка.Видимость = Ложь;
		Элементы.ИмяПодменю.Видимость = Ложь;
		Элементы.ПредставлениеПодменю.Видимость = Ложь;
		Элементы.ТолькоДляМеня.Видимость = Ложь;
		Элементы.ЭтоРазделитель.Видимость = Ложь;
		Элементы.ПерезаписатьТекстЗапроса.Видимость = Ложь;
		Элементы.ПерезаписатьТекстКод.Видимость = Ложь;
		Элементы.ФормаСохранитьКоманду.Заголовок = "Сохранить настройку";
	Иначе
		Элементы.ДекорацияПредупреждениеОФайле.Видимость = Ложь;
		Элементы.СохранитьКоманды.Видимость = Ложь;
		Элементы.СохранитьМеню.Видимость = Ложь;
		Элементы.СохранитьЧАКО.Видимость = Ложь;
	КонецЕсли;
	#Область ТЕСТ
		//ИмяКоманды = "Тестовая230129";
		//ПредставлениеКоманды = "Текстовый запросик";
		//ИмяПодменю = "ПодменнюшкаТест230129";
		//ПредставлениеПодменю = "Тестирование этой обработки";
		//ПередПосле = "После";
		//ПутьККартинке = "#Б:ГеографическаяСхема";
		//ХотКей = "Ctrl+D";
		//Подсказка = "Подсказочка";
		//СохранитьТекстЗапроса = Истина;
		//СохранитьТаб1 = Истина;
	#КонецОбласти
КонецПроцедуры

#КонецОбласти

#Область СОБЫТИЯ_ЭЛЕМЕНТОВ
	
&НаКлиенте
Процедура ПутьККартинкеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СписокКартинок = ПолучитьСписокКартинокНаСервере();
	СписокКартинок.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПродолжитьВыборКартинки", ЭтотОбъект, "Выбор картинки"));
КонецПроцедуры

&НаКлиенте
Процедура ЭтоПодменюПриИзменении(Элемент)
	Элементы.Подъезд2.Видимость = НЕ ЭтоРазделитель;
	Элементы.Подъезд3.Видимость = НЕ ЭтоРазделитель;
	Элементы.Подъезд4.Видимость = НЕ ЭтоРазделитель;
	Элементы.Подъезд5.Видимость = НЕ ЭтоРазделитель;
	//Элементы.Потолок.Видимость = НЕ ВидноВсё;
КонецПроцедуры

#КонецОбласти

#Область КОМАНДЫ
	
&НаКлиенте
Процедура СохранитьКоманду(Команда)
	Если ВладелецФормы.КомандаЕстьВСК(ИмяКоманды) Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПродолжитьСохранениеКоманды", ЭтотОбъект),
				"Продолжить сохранение (старый вариант команды будет перезаписан)?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет, "Такая команда уже есть");
	Иначе
		ПродолжитьСохранениеКоманды(КодВозвратаДиалога.Да, Новый Структура);
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ
	
// Возвращает список доступных стандартных картинок
&НаСервере
Функция ПолучитьСписокКартинокНаСервере()
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьСписокСтандартныхКартинок();
КонецФункции // ПолучитьСписокКартинокНаСервере

&НаКлиенте
Процедура ПродолжитьВыборКартинки(ЭлементСписка, СтрПарам) Экспорт
	Если ЭлементСписка = Неопределено Тогда
	Иначе
		ПутьККартинке = ЭлементСписка.Значение;
	КонецЕсли; 
КонецПроцедуры

// Сохраняет команду
// Параметры:
//  Результат  - КодВозвратаДиалога - Результат обрабочика
&НаКлиенте
Процедура ПродолжитьСохранениеКоманды(Результат, ПереданныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрСохранения = Новый Структура("ИмяКоманды,ИмяПодменю,Подсказка,ПредставлениеКоманды,ПредставлениеПодменю,ПутьККоманде,ПутьККартинке,ПередПосле,"
				+ "ПерезаписатьТекстЗапроса,ПерезаписатьТекстКода,СохранитьТекстКода,СохранитьТекстЗапроса,СохранитьПредмет,"
				+ "СохранитьПараметры,СохранитьКоманды,СохранитьМеню,СохранитьЧАКО,ЭтоРазделитель,СохранитьСКД,СохранитьТаб1,СохранитьТаб2,СохранитьТД,ТолькоДляМеня,ХотКей",
				ИмяКоманды, ИмяПодменю, Подсказка, ПредставлениеКоманды, ПредставлениеПодменю, ПутьККоманде, ПутьККартинке, ПередПосле,
				ПерезаписатьТекстЗапроса, ПерезаписатьТекстКод, СохранитьТекстКода, СохранитьТекстЗапроса, СохранитьПредмет, СохранитьПараметры,
				СохранитьКоманды, СохранитьМеню, СохранитьЧАКО, ЭтоРазделитель, СохранитьСКД, СохранитьТаб1, СохранитьТаб2, СохранитьТД, ТолькоДляМеня, ХотКей);
		ВладелецФормы.ЗаписатьНовуюСК(ПараметрСохранения, КудаСохранять);
		Закрыть();
	КонецЕсли; 
КонецПроцедуры // ПродолжитьСохранениеКоманды

#КонецОбласти


